---
kind: method
id: M:Autodesk.Revit.DB.DividedSurface.RemoveAllIntersectionElements
source: html/90969247-211f-92f5-1973-5202e9b2287f.htm
---
# Autodesk.Revit.DB.DividedSurface.RemoveAllIntersectionElements Method

Removes all the intersection elements from a divided surface.

## Syntax (C#)
```csharp
public void RemoveAllIntersectionElements()
```